spec/fixtures/vcr_cassettes/go_cardless_successful_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/mandates/MD0000PSV8N7FR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-darwin15 faraday/0.9.2
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 19 Aug 2016 13:52:18 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=df4e4357a1c58655414b90562214d48d81471614738; expires=Sat, 19-Aug-17
        13:52:18 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"d8e093f9dfe4d212699e8a2005b91d9b"
      X-Request-Id:
      - 015e60d4-3102-48c5-9cc5-003ccb400a2a
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '997'
      Ratelimit-Reset:
      - Fri, 19 Aug 2016 13:53:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2d4e15d5b58a34ee-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"mandates":{"id":"MD0000PSV8N7FR","created_at":"2016-04-11T19:16:56.421Z","reference":"OMAR-JMEKNM53MREX3","status":"active","scheme":"bacs","next_possible_charge_date":"2016-08-24","payments_require_approval":false,"metadata":{},"links":{"customer_bank_account":"BA0000P8MREF5F","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Fri, 19 Aug 2016 13:52:18 GMT
- request:
    method: post
    uri: https://api-sandbox.gocardless.com/subscriptions
    body:
      encoding: UTF-8
      string: '{"subscriptions":{"amount":1155,"currency":"GBP","links":{"mandate":"MD0000PSV8N7FR"},"metadata":{"customer_id":"CU0000RR39FMVB"},"name":"donation","interval_unit":"monthly","start_date":"2016-09-20"}}'
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-darwin15 faraday/0.9.2
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Fri, 19 Aug 2016 13:52:19 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dc88ba51edcb6d92062f1879b4b6afd921471614739; expires=Sat, 19-Aug-17
        13:52:19 GMT; path=/; domain=.gocardless.com; HttpOnly
      Location:
      - https://api-sandbox.gocardless.com/subscriptions/SB00003GHBQ3YF
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"d593becf813e1d556125e4dd9fad44b2"
      X-Request-Id:
      - e743b92e-77bf-427e-a0e5-9984e9d627a4
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '996'
      Ratelimit-Reset:
      - Fri, 19 Aug 2016 13:53:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2d4e15d74bd60ce3-LHR
    body:
      encoding: UTF-8
      string: '{"subscriptions":{"id":"SB00003GHBQ3YF","created_at":"2016-08-19T13:52:19.207Z","amount":1155,"currency":"GBP","status":"active","name":"donation","start_date":"2016-09-20","end_date":null,"interval":1,"interval_unit":"monthly","day_of_month":null,"month":null,"metadata":{"customer_id":"CU0000RR39FMVB"},"payment_reference":null,"upcoming_payments":[{"charge_date":"2016-09-20","amount":1155},{"charge_date":"2016-10-20","amount":1155},{"charge_date":"2016-11-21","amount":1155},{"charge_date":"2016-12-20","amount":1155},{"charge_date":"2017-01-20","amount":1155},{"charge_date":"2017-02-20","amount":1155},{"charge_date":"2017-03-20","amount":1155},{"charge_date":"2017-04-20","amount":1155},{"charge_date":"2017-05-22","amount":1155},{"charge_date":"2017-06-20","amount":1155}],"links":{"mandate":"MD0000PSV8N7FR"}}}'
    http_version: 
  recorded_at: Fri, 19 Aug 2016 13:52:19 GMT
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/customer_bank_accounts/BA0000P8MREF5F
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-darwin15 faraday/0.9.2
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 19 Aug 2016 13:52:19 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=de0a5759865cc34689f6052c33d89f9fd1471614739; expires=Sat, 19-Aug-17
        13:52:19 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"99768e118859112446e345f44d692f3c"
      X-Request-Id:
      - 7d0bc468-91fa-4fc7-a149-edb9af304093
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '995'
      Ratelimit-Reset:
      - Fri, 19 Aug 2016 13:53:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2d4e15d9d7f506c4-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"customer_bank_accounts":{"id":"BA0000P8MREF5F","created_at":"2016-04-11T19:16:56.376Z","account_number_ending":"11","account_holder_name":"S
        SAMWELL","bank_name":"BARCLAYS BANK PLC","currency":"GBP","country_code":"GB","metadata":{},"enabled":true,"links":{"customer":"CU0000RR39FMVB"}}}'
    http_version: 
  recorded_at: Fri, 19 Aug 2016 13:52:19 GMT
recorded_with: VCR 3.0.3
