spec/fixtures/vcr_cassettes/go_cardless_unsuccessful_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/mandates/MD0000PSV8N7FR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-darwin15 faraday/0.9.2
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 19 Aug 2016 13:52:24 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dd81afd6d9d0c78c5274e9a0040c26df21471614744; expires=Sat, 19-Aug-17
        13:52:24 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"d8e093f9dfe4d212699e8a2005b91d9b"
      X-Request-Id:
      - f1736450-0bb6-4d03-9d8c-cd6f54c3182b
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '994'
      Ratelimit-Reset:
      - Fri, 19 Aug 2016 13:53:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2d4e15f8161f345e-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"mandates":{"id":"MD0000PSV8N7FR","created_at":"2016-04-11T19:16:56.421Z","reference":"OMAR-JMEKNM53MREX3","status":"active","scheme":"bacs","next_possible_charge_date":"2016-08-24","payments_require_approval":false,"metadata":{},"links":{"customer_bank_account":"BA0000P8MREF5F","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Fri, 19 Aug 2016 13:52:24 GMT
- request:
    method: post
    uri: https://api-sandbox.gocardless.com/subscriptions
    body:
      encoding: UTF-8
      string: '{"subscriptions":{"amount":1155,"currency":"GBP","links":{"mandate":null},"metadata":{"customer_id":"CU0000RR39FMVB"},"name":"donation","interval_unit":"monthly","start_date":"2016-09-20"}}'
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-darwin15 faraday/0.9.2
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 422
      message: Unprocessable Entity
    headers:
      Date:
      - Fri, 19 Aug 2016 13:52:24 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d2a4f084cc768f162726556fe24fc85d31471614744; expires=Sat, 19-Aug-17
        13:52:24 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      X-Request-Id:
      - 80c61614-3669-42c4-9861-369bf4f78cf1
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '993'
      Ratelimit-Reset:
      - Fri, 19 Aug 2016 13:53:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2d4e15f98819139b-LHR
    body:
      encoding: UTF-8
      string: '{"error":{"message":"One of your parameters was incorrectly typed","errors":[{"message":"nil
        is not a string.","field":"mandate_id","request_pointer":"/subscriptions/links/mandate"}],"documentation_url":"https://developer.gocardless.com/pro#invalid_type","type":"invalid_api_usage","request_id":"80c61614-3669-42c4-9861-369bf4f78cf1","code":422}}'
    http_version: 
  recorded_at: Fri, 19 Aug 2016 13:52:24 GMT
recorded_with: VCR 3.0.3
